novolife/HC32F4A0-DDL/midwares/hc32/emulate_eeprom/hc32_flash_emulate_eeprom.c
/**
 *******************************************************************************
 * @file  hc32_flash_emulate_eeprom.c
 * @brief Main program of HC32 family for flash emulate eeprom.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2024-06-30       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2025, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_flash_emulate_eeprom.h"

/**
 * @defgroup LL_EMULATE_EEPROM_LIB LL EMULATE EEPROM Lib
 * @{
 */

/**
 * @defgroup HC32_FLASH_EMULATE_EEPROM HC32 FLASH EMULATE EEPROM
 * @{
 */

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup EEPROM_Local_Types EEPROM Local Types
 * @{
 */

/**
 * @defgroup EEPROM_Address_Offset EEPROM Address Offset
 * @{
 */

/* used to store next addr which data is written in flash */
typedef struct {
    uint32_t u32WriteAddr;
    uint32_t u32ReadAddr;
} stc_eeprom_addr_offset_info_t;

/**
 * @}
 */

/**
 * @defgroup EEPROM_Operate_Status EEPROM Operate Status
 * @{
 */

typedef struct {
    int32_t i32EEStatus;
    ee_addr_size_t remainLen;
    ee_data_size_t *pData;
} stc_eeprom_operate_status_t;

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup EEPROM_Local_Macros EEPROM Local Macros
 * @{
 */

/* Used Flash sectors for EEPROM emulation */
#define SECT0                       (0x00U)
#define SECT1                       (0x01U)

/* Sector status definitions */
#define ERASED                      ((ee_data_addr_size_t)0xFFFFFFFFUL) /* Sector is empty */
#define RECEIVE_DATA                ((ee_data_addr_size_t)0xEEEEEEEEUL) /* Sector is marked to receive data */
#define VALID_SECTOR                ((ee_data_addr_size_t)0x00000000UL) /* Sector containing valid data */

/* Valid sectors in read and write defines */
#define READ_FROM_VALID_SECTOR      (0x00U)
#define WRITE_IN_VALID_SECTOR       (0x01U)

#define EE_ADDR_OFFSET              (sizeof(ee_data_addr_size_t) - sizeof(ee_data_size_t))

#define EE_UNLOCK()                 EFM_FWMC_Cmd(ENABLE)
#define EE_LOCK()                   EFM_FWMC_Cmd(DISABLE)

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
static int32_t EE_Reset(void);
static void EE_UpdatePositionIndex(void);
static uint8_t EE_FindValidSector(uint8_t u8OperationType);
static uint8_t EE_VerifySectorFullyErased(uint32_t Address);
static int32_t EE_ReadDataformFlash(ee_addr_size_t VirtAddress, ee_data_size_t *Data);
static stc_eeprom_operate_status_t EE_CheckSectorFullWrite(ee_addr_size_t VirtAddress, ee_data_size_t *Data, ee_addr_size_t u16Len);
/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
/**
 * @defgroup EEPROM_Local_Variables EEPROM Local Variables
 * @{
 */

static ee_data_size_t DataVar = 0;
static stc_eeprom_addr_offset_info_t stc_ee_addr_offset = {0};

/**
 * @}
 */
/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup EEPROM_Local_Functions EEPROM Local Functions
 * @{
 */

static int32_t Flash_EraseSector(uint32_t u32Addr)
{
    int32_t  i32FlashStatus = EE_ERR_NOT_RDY;
    ee_data_size_t i;

    EE_UNLOCK();
    for (i = 0; i < EEPROM_SECTOR_SIZE / EFM_SECTOR_SIZE; i++) {
        i32FlashStatus = EFM_SectorErase(u32Addr + i * EFM_SECTOR_SIZE);
    }
    EE_LOCK();
    return i32FlashStatus;
}

static int32_t Flash_WriteOneData(uint32_t u32Addr, ee_data_addr_size_t data)
{
    int32_t i32FlashStatus;

    EE_UNLOCK();
    i32FlashStatus = EFM_Program(u32Addr, (const uint8_t *)&data, sizeof(ee_data_addr_size_t));
    EE_LOCK();
    return i32FlashStatus;
}

/**
  * @brief  Update EEPROM Write/Read Position Index.
  * @param  None
  * @retval None
  */
static void EE_UpdatePositionIndex(void)
{
    uint8_t u8ValidSector;
    uint32_t u32Address, u32SectorEndAddress;

    u8ValidSector = EE_FindValidSector(WRITE_IN_VALID_SECTOR);

    if (u8ValidSector == EE_ERR_SECT_INVALID) {
        return ;
    }
    /* Get the valid Sector start Address */
    u32Address = (uint32_t)(EEPROM_START_ADDR + (uint32_t)(u8ValidSector * EEPROM_SECTOR_SIZE));
    /* Get the valid Sector end Address */
    u32SectorEndAddress = (uint32_t)((EEPROM_START_ADDR - 1UL) + (uint32_t)((u8ValidSector + 1UL) * EEPROM_SECTOR_SIZE));

    while (u32Address < u32SectorEndAddress) {
        /* Find Available address in FLASH */
        if ((*(__IO ee_data_addr_size_t *)u32Address) == (ee_data_addr_size_t)0xFFFFFFFFUL) {
            break;
        } else {
            /* Next address */
            u32Address = u32Address + sizeof(ee_data_addr_size_t);
        }
    }

