novolife/HC32F4A0-DDL/midwares/hc32/emulate_eeprom/hc32_flash_emulate_eeprom.c
    stc_ee_addr_offset.u32WriteAddr = (uint32_t)((u32Address - (uint32_t)(EEPROM_START_ADDR + u8ValidSector * EEPROM_SECTOR_SIZE)));
    if (u8ValidSector == EE_FindValidSector(READ_FROM_VALID_SECTOR)) {
        stc_ee_addr_offset.u32ReadAddr = stc_ee_addr_offset.u32WriteAddr;
    }
}

/**
  * @brief  Verify if specified sector is fully erased.
  * @param  [in] u32Address     sector address
  *   This parameter can be one of the following values:
  *     @arg SECT0_BASE_ADDR    Sector0 base address
  *     @arg SECT1_BASE_ADDR    Sector1 base address
  * @retval uint8_t:
  *         - 0: Sector not erased
  *         - 1: Sector erased
  */
static uint8_t EE_VerifySectorFullyErased(uint32_t u32Address)
{
    uint8_t u8ReadStatus = 1U;
    ee_data_addr_size_t AddressValue;
    uint32_t EndSectorAddr = u32Address + EEPROM_SECTOR_SIZE - 1UL ;

    while (u32Address <= EndSectorAddr) {
        /* Get the current address value */
        AddressValue = (*(__IO ee_data_addr_size_t *)u32Address);

        /* Compare the value with ERASED */
        if (AddressValue != ERASED) {
            u8ReadStatus = 0U;
            break;
        }
        /* Next address */
        u32Address = u32Address + sizeof(ee_data_addr_size_t);
    }

    return u8ReadStatus;
}

/**
  * @brief  Read specified virtual address data from FLASH
  * @param  [in] VirtAddress            Virtual eeprom address
  * @param  [out] Data                  Pointer of receive data
  * @retval int32_t:
  *         - EE_OK: valid virtual EEPROM address was found
  *         - EE_ERR: valid virtual EEPROM address was not found
  *         - EE_ERR_SECT_INVALID: No valid sector was found
  */
static int32_t EE_ReadDataformFlash(ee_addr_size_t VirtAddress, ee_data_size_t *Data)
{
    uint8_t u8ValidSector;
    ee_addr_size_t AddressValue;
    int32_t i32ReadStatus = EE_ERR;
    uint32_t u32Address, u32SectorStartAddress;

    /* Get active Sector for read operation */
    u8ValidSector = EE_FindValidSector(READ_FROM_VALID_SECTOR);
    if (u8ValidSector == EE_ERR_SECT_INVALID) {
        return (int32_t)EE_ERR_SECT_INVALID;
    }

    /* Get the valid Sector start Address */
    u32SectorStartAddress = (uint32_t)(EEPROM_START_ADDR + (uint32_t)(u8ValidSector * EEPROM_SECTOR_SIZE));
    /* Get the valid Sector read Address */
    if (stc_ee_addr_offset.u32ReadAddr == 0UL) {
        u32Address = (uint32_t)((EEPROM_START_ADDR - EE_ADDR_OFFSET) + (uint32_t)((1UL + u8ValidSector) * EEPROM_SECTOR_SIZE));
    } else {
        u32Address = (uint32_t)((EEPROM_START_ADDR + stc_ee_addr_offset.u32ReadAddr - EE_ADDR_OFFSET) + (uint32_t)(u8ValidSector * EEPROM_SECTOR_SIZE));
    }

    while (u32Address > (u32SectorStartAddress + EE_ADDR_OFFSET)) {
        /* Get the current address value */
        AddressValue = (*(__IO ee_addr_size_t *)u32Address);

        /* Compare the value with the virtual address */
        if (AddressValue == VirtAddress) {
            *Data = (*(__IO ee_data_size_t *)(u32Address - sizeof(ee_data_size_t)));
            i32ReadStatus = EE_OK;
            break;
        } else {
            /* Next address */
            u32Address = u32Address - sizeof(ee_data_addr_size_t);
        }
    }

    return i32ReadStatus;
}

/**
  * @brief  Erases SECTOR0 and SECTOR1 and writes VALID_SECTOR header to SECTOR0
  * @param  None
  * @retval int32_t:
  *         - EE_OK: Program successful.
  *         - EE_ERR_NOT_RDY: EFM if not ready
  */
static int32_t EE_Reset(void)
{
    int32_t i32FlashStatus;
    /* Erase Sector0 */
    if (0U == EE_VerifySectorFullyErased(SECT0_BASE_ADDR)) {
        i32FlashStatus = Flash_EraseSector(SECT0_BASE_ADDR);
        if (i32FlashStatus != EE_OK) {
            return i32FlashStatus;
        }
    }
    /* Set Sector0 as valid sector */
    i32FlashStatus = Flash_WriteOneData(SECT0_BASE_ADDR, VALID_SECTOR);

    if (i32FlashStatus != EE_OK) {
        return i32FlashStatus;
    }

    /* Erase Sector1 */
    if (0U == EE_VerifySectorFullyErased(SECT1_BASE_ADDR)) {
        i32FlashStatus = Flash_EraseSector(SECT1_BASE_ADDR);
        if (i32FlashStatus != EE_OK) {
            return i32FlashStatus;
        }
    }

    return EE_OK;
}

/**
  * @brief  Find valid Sector for write or read operation
  * @param  [in] u8OperationType            operation condition.
  *   This parameter can be one of the following values:
  *     @arg READ_FROM_VALID_SECTOR         read operation
  *     @arg WRITE_IN_VALID_SECTOR          write operation
  * @retval uint8_t:
  *         - SECT0: Sector 0 valid
  *         - SECT1: Sector 1 valid
  */
static uint8_t EE_FindValidSector(uint8_t u8OperationType)
{
    ee_data_addr_size_t SectorStatus0, SectorStatus1;

    SectorStatus0 = (*(__IO ee_data_addr_size_t *)SECT0_BASE_ADDR);
    SectorStatus1 = (*(__IO ee_data_addr_size_t *)SECT1_BASE_ADDR);

    /**
    * write operation: sector which status is RECEIVE_DATA is higher than
    * status is VALID_SECTOR
    * read operation: depend on sector status is VALID_SECTOR
    */
    switch (u8OperationType) {
        case WRITE_IN_VALID_SECTOR:
            if (SectorStatus1 == VALID_SECTOR) {
                if (SectorStatus0 == RECEIVE_DATA) {
                    return SECT0;
                } else {
                    return SECT1;
                }
            } else if (SectorStatus0 == VALID_SECTOR) {
                if (SectorStatus1 == RECEIVE_DATA) {
                    return SECT1;
                } else {
                    return SECT0;
                }
            } else {
                return EE_ERR_SECT_INVALID;
            }
        case READ_FROM_VALID_SECTOR:
            if (SectorStatus0 == VALID_SECTOR) {
                return SECT0;
            } else if (SectorStatus1 == VALID_SECTOR) {
                return SECT1;
            } else {
                return EE_ERR_SECT_INVALID;
            }
        default:
            return SECT0;
    }
}

/**
  * @brief  Check if current active sector is full and Write virtual eeprom address and data in FLASH
  * @param  [in] VirtAddress        virtual eeprom address
  * @param  [in] Data               pointer of data to be written
  * @param  [in] length             length of data
  * @retval stc_eeprom_operate_status_t
  */
static stc_eeprom_operate_status_t EE_CheckSectorFullWrite(ee_addr_size_t VirtAddress, ee_data_size_t *Data, ee_addr_size_t length)
{
    stc_eeprom_operate_status_t stc_ee_operate_status;
    uint8_t u8ValidSector;
    uint32_t u32Address, u32SectorEndAddress;

