novolife/HC32F4A0-DDL/midwares/hc32/emulate_eeprom/hc32_flash_emulate_eeprom.c
    stc_ee_operate_status.remainLen = length;
    stc_ee_operate_status.pData = Data;

    u8ValidSector = EE_FindValidSector(WRITE_IN_VALID_SECTOR);

    if (u8ValidSector == EE_ERR_SECT_INVALID) {
        stc_ee_operate_status.i32EEStatus = (int32_t)EE_ERR_SECT_INVALID;
        return stc_ee_operate_status;
    }
    /* Get the valid Sector start Address */
    u32Address = (uint32_t)(EEPROM_START_ADDR + (uint32_t)(u8ValidSector * EEPROM_SECTOR_SIZE)) + stc_ee_addr_offset.u32WriteAddr;
    /* Get the valid Sector end Address */
    u32SectorEndAddress = (uint32_t)((EEPROM_START_ADDR - 1UL) + (uint32_t)((u8ValidSector + 1UL) * EEPROM_SECTOR_SIZE));

    while (u32Address < u32SectorEndAddress) {
        /* Find Available address in FLASH */
        if ((*(__IO ee_data_addr_size_t *)u32Address) == (ee_data_addr_size_t)0xFFFFFFFFUL) {
            stc_ee_operate_status.i32EEStatus = Flash_WriteOneData(u32Address,
                                                                   (((ee_data_addr_size_t)VirtAddress << 8U * sizeof(ee_data_size_t)) | *stc_ee_operate_status.pData));
            if (stc_ee_operate_status.i32EEStatus != EE_OK) {
                return stc_ee_operate_status;
            }

            stc_ee_addr_offset.u32WriteAddr = (u32Address + sizeof(ee_data_addr_size_t) - (uint32_t)(EEPROM_START_ADDR + u8ValidSector * EEPROM_SECTOR_SIZE));
            if (EE_FindValidSector(READ_FROM_VALID_SECTOR) == u8ValidSector) {
                stc_ee_addr_offset.u32ReadAddr = stc_ee_addr_offset.u32WriteAddr;
            }

            if (--stc_ee_operate_status.remainLen == 0U) {
                /* Write done */
                return stc_ee_operate_status;
            }
            VirtAddress ++;
            stc_ee_operate_status.pData ++;
        } else {
            /* Next address */
            u32Address = u32Address + sizeof(ee_data_addr_size_t);
        }
    }
    /* Valid sector is full */
    stc_ee_operate_status.i32EEStatus = EE_ERR_SECT_FULL;

    return stc_ee_operate_status;
}

/**
  * @brief  Swap sector and transfer valid data to new active sector
  * @param  [in] VirtAddress        virtual eeprom address
  * @param  [in] Data               pointer of data to be written
  * @param  [in] length             length of data
  * @retval int32_t:
  *         - EE_OK: Program successful.
  *         - EE_ERR_NOT_RDY: EFM if not ready
  *         - EE_ERR_SECT_FULL: Valid sector is full
  *         - EE_ERR_SECT_INVALID: No valid sector was found
  */
static int32_t EE_SectorSwapWrite(ee_addr_size_t VirtAddress, ee_data_size_t *Data, ee_addr_size_t length)
{
    stc_eeprom_operate_status_t stc_ee_operate_status;
    uint8_t u8ValidSector;
    ee_addr_size_t VarIdx;
    int32_t i32FlashStatus;
    uint32_t u32NewSectorAddress;
    uint32_t u32OldSectorAddress;
    int32_t i32ReadStatus;

    u8ValidSector = EE_FindValidSector(READ_FROM_VALID_SECTOR);
    if (u8ValidSector == SECT1) {
        u32NewSectorAddress = SECT0_BASE_ADDR;
        u32OldSectorAddress = SECT1_BASE_ADDR;
    } else if (u8ValidSector == SECT0) {
        u32NewSectorAddress = SECT1_BASE_ADDR;
        u32OldSectorAddress = SECT0_BASE_ADDR;
    } else {
        return (int32_t)EE_ERR_SECT_INVALID;
    }

    /* Set the new Sector status to RECEIVE_DATA status */
    i32FlashStatus = Flash_WriteOneData(u32NewSectorAddress, RECEIVE_DATA);
    if (i32FlashStatus != EE_OK) {
        return i32FlashStatus;
    }

    stc_ee_addr_offset.u32WriteAddr = 0U;
    /* Write the variable passed as parameter in the new active sector */
    stc_ee_operate_status = EE_CheckSectorFullWrite(VirtAddress, Data, length);
    if (stc_ee_operate_status.i32EEStatus != EE_OK) {
        return stc_ee_operate_status.i32EEStatus;
    }

    /* Transfer data from old to the new active sector */
    for (VarIdx = 0; VarIdx < EE_CAPACITY; VarIdx++) {
        if (VarIdx != VirtAddress) {
            /* Transfer other valid virtual eeprom address and data except VirtAddress to new active sector */
            i32ReadStatus = EE_ReadDataformFlash(VarIdx, &DataVar);
            /* Valid virtual address was found */
            if (EE_OK == i32ReadStatus) {
                stc_ee_operate_status = EE_CheckSectorFullWrite(VarIdx, &DataVar, 1U);
                if (stc_ee_operate_status.i32EEStatus != EE_OK) {
                    return stc_ee_operate_status.i32EEStatus;
                }
            }
        } else {
            VarIdx += length - 1U;
        }
    }

    /* Erase the old Sector: Set old Sector status to ERASED status */
    i32FlashStatus = Flash_EraseSector(u32OldSectorAddress);
    if (i32FlashStatus != EE_OK) {
        return i32FlashStatus;
    }

    /* Set new Sector status to VALID_SECTOR status */
    i32FlashStatus = Flash_WriteOneData(u32NewSectorAddress, VALID_SECTOR);
    if (i32FlashStatus != EE_OK) {
        return i32FlashStatus;
    }

    /* Update read index loction */
    stc_ee_addr_offset.u32ReadAddr = stc_ee_addr_offset.u32WriteAddr;

    return i32FlashStatus;
}

/**
 * @}
 */

/**
 * @defgroup EEPROM_Global_Functions EEPROM Global Functions
 * @{
 */

/**
  * @brief  Restore the sectors to a expectations state after power loss
  * @param  None
  * @retval int32_t:
  *         - EE_OK: Init successful.
  *         - EE_ERR_NOT_RDY: EFM if not ready
  *         - EE_ERR_SECT_FULL: Valid sector is full
  *         - EE_ERR_SECT_INVALID: No valid sector was found
  */
int32_t EE_FlashInit(void)
{
    ee_data_addr_size_t SectorStatus0, SectorStatus1;
    ee_addr_size_t VarIdx;
    uint32_t u32Index = 0xFFFFFFFFUL;
    int32_t  i32FlashStatus;
    stc_eeprom_operate_status_t stc_ee_operate_status;

    /* Get Sector0 status */
    SectorStatus0 = (*(__IO ee_data_addr_size_t *)SECT0_BASE_ADDR);
    /* Get Sector1 status */
    SectorStatus1 = (*(__IO ee_data_addr_size_t *)SECT1_BASE_ADDR);

    /**
     * The possible states of the sectors are as below:
     * ---------------------------------------------------------------------|
     *              |                   sector0                             |
     *              |-------------------------------------------------------|
     *  sector1     |   erase       |       receive     |       valid       |
     * -------------|---------------|-------------------|-------------------|
     *  erase       |   invalid     |   erase 1 &       |   erase 1 &       |
     *              |   EE_Reset    |   mark 0 valid    |   use 0 as valid  |
     * -------------|---------------|-------------------|-------------------|
     *              |               |                   |   transfer data   |
     *              |  erase 0      |   invalid         |   form 0 to 1     |
     *   receive    |  mark 1 valid |   EE_Reset        |   mark 1 valid    |
     *              |               |                   |   erase 0         |
     * -------------|---------------|-------------------|-------------------|
     *              |               |   transfer data   |                   |
     *  valid       |   erase0      |   form 1 to 0     |   invalid         |
     *              | use 1 as valid|   mark 0 valid    |   EE_Reset        |
     *              |               |   erase 1         |                   |
     * ---------------------------------------------------------------------|
    */
    switch (SectorStatus0) {
        case ERASED:
            if (SectorStatus1 == VALID_SECTOR) {
                /* Erase Sector0 */
                if (0U == EE_VerifySectorFullyErased(SECT0_BASE_ADDR)) {
                    i32FlashStatus = Flash_EraseSector(SECT0_BASE_ADDR);
                    if (i32FlashStatus != EE_OK) {
                        return i32FlashStatus;
                    }
                }
            } else if (SectorStatus1 == RECEIVE_DATA) {
                /* Erase Sector0 */
                if (0U == EE_VerifySectorFullyErased(SECT0_BASE_ADDR)) {
                    i32FlashStatus = Flash_EraseSector(SECT0_BASE_ADDR);
                    if (i32FlashStatus != EE_OK) {
                        return i32FlashStatus;
                    }
                }
                /* Mark Sector1 as valid */
                i32FlashStatus = Flash_WriteOneData(SECT1_BASE_ADDR, VALID_SECTOR);
                if (i32FlashStatus != EE_OK) {
                    return i32FlashStatus;
                }
            } else {
                /* Erase both Sector0 and Sector1 and set Sector0 as valid sector */
                i32FlashStatus = EE_Reset();
                if (i32FlashStatus != EE_OK) {
                    return i32FlashStatus;
                }
            }
            break;

        case RECEIVE_DATA:
            if (SectorStatus1 == VALID_SECTOR) {
                /* Transfer data from Sector1 to Sector0 */
                for (VarIdx = 0; VarIdx < EE_CAPACITY; VarIdx++) {
                    if ((*(__IO ee_addr_size_t *)(SECT0_BASE_ADDR + EE_SEC_VALID_ADDR_FIRST)) == VarIdx) {
                        u32Index = VarIdx;
                    }
                    if (VarIdx != u32Index) {
                        /* Transfer valid virtual eeprom address and data to sector0 */
                        if (EE_OK == EE_ReadDataformFlash(VarIdx, &DataVar)) {
                            /* Valid virtual address was found */
                            stc_ee_operate_status = EE_CheckSectorFullWrite(VarIdx, &DataVar, 1U);
                            if (stc_ee_operate_status.i32EEStatus != EE_OK) {
                                return stc_ee_operate_status.i32EEStatus;
                            }
                        }
                    }
                }
                /* Erase Sector1 */
                if (0U == EE_VerifySectorFullyErased(SECT1_BASE_ADDR)) {
                    i32FlashStatus = Flash_EraseSector(SECT1_BASE_ADDR);
                    if (i32FlashStatus != EE_OK) {
                        return i32FlashStatus;
                    }
                }
                /* Mark Sector0 as valid */
                i32FlashStatus = Flash_WriteOneData(SECT0_BASE_ADDR, VALID_SECTOR);
                if (i32FlashStatus != EE_OK) {
                    return i32FlashStatus;
                }
            } else if (SectorStatus1 == ERASED) {
                /* Erase Sector1 */
                if (0U == EE_VerifySectorFullyErased(SECT1_BASE_ADDR)) {
                    i32FlashStatus = Flash_EraseSector(SECT1_BASE_ADDR);
                    if (i32FlashStatus != EE_OK) {
                        return i32FlashStatus;
                    }
                }
                /* Mark Sector0 as valid */
                i32FlashStatus = Flash_WriteOneData(SECT0_BASE_ADDR, VALID_SECTOR);
                if (i32FlashStatus != EE_OK) {
                    return i32FlashStatus;
                }
            } else {
                i32FlashStatus = EE_Reset();
                if (i32FlashStatus != EE_OK) {
                    return i32FlashStatus;
                }
            }
            break;
        case VALID_SECTOR:
            if (SectorStatus1 == ERASED) {
                if (0U == EE_VerifySectorFullyErased(SECT1_BASE_ADDR)) {
                    i32FlashStatus = Flash_EraseSector(SECT1_BASE_ADDR);
                    if (i32FlashStatus != EE_OK) {
                        return i32FlashStatus;
                    }
                }
            } else if (SectorStatus1 == RECEIVE_DATA) {
                for (VarIdx = 0; VarIdx < EE_CAPACITY; VarIdx++) {
                    if ((*(__IO ee_addr_size_t *)(SECT1_BASE_ADDR + EE_SEC_VALID_ADDR_FIRST)) == VarIdx) {
                        u32Index = VarIdx;
                    }
                    if (VarIdx != u32Index) {
                        if (EE_OK == EE_ReadDataformFlash(VarIdx, &DataVar)) {
                            stc_ee_operate_status = EE_CheckSectorFullWrite(VarIdx, &DataVar, 1U);
                            if (stc_ee_operate_status.i32EEStatus != EE_OK) {
                                return stc_ee_operate_status.i32EEStatus;
                            }
                        }
                    }
                }
                if (0U == EE_VerifySectorFullyErased(SECT0_BASE_ADDR)) {
                    i32FlashStatus = Flash_EraseSector(SECT0_BASE_ADDR);
                    if (i32FlashStatus != EE_OK) {
                        return i32FlashStatus;
                    }
                }
                i32FlashStatus = Flash_WriteOneData(SECT1_BASE_ADDR, VALID_SECTOR);
                if (i32FlashStatus != EE_OK) {
                    return i32FlashStatus;
                }
            } else {
                i32FlashStatus = EE_Reset();
                if (i32FlashStatus != EE_OK) {
                    return i32FlashStatus;
                }
            }
            break;

        default:
            i32FlashStatus = EE_Reset();
            if (i32FlashStatus != EE_OK) {
                return i32FlashStatus;
            }
            break;
    }

    EE_UpdatePositionIndex();

    return EE_OK;
}

/**
  * @brief  Write specified length data to FLASH
  * @param  [in] virtAddress        virtual eeprom address
  * @param  [in] data               pointer of data to be written
  * @param  [in] length             length of data
  * @retval int32_t:
  *         - EE_OK: Program successful.
  *         - EE_ERR: Parameters eeror
  *         - EE_ERR_NOT_RDY: EFM if not ready
  *         - EE_ERR_SECT_FULL: Valid sector is full
  *         - EE_ERR_SECT_INVALID: No valid sector was found
  */
int32_t EE_WriteNBytes(ee_addr_size_t virtAddress, ee_data_size_t *data, ee_addr_size_t length)
{
    stc_eeprom_operate_status_t stc_ee_operate_status;

    if (virtAddress + length > EE_CAPACITY) {
        return EE_ERR_INVD_PARAM;
    }

    if (0U == length) {
        return EE_ERR_INVD_PARAM;
    }

