novolife/HC32F4A0-DDL/midwares/hc32/emulate_eeprom/hc32_flash_emulate_eeprom.c
    stc_ee_operate_status = EE_CheckSectorFullWrite(virtAddress, data, length);

    if (stc_ee_operate_status.i32EEStatus == EE_ERR_SECT_FULL) {
        stc_ee_operate_status.i32EEStatus = \
                                            EE_SectorSwapWrite(
                                                virtAddress + (length - stc_ee_operate_status.remainLen),
                                                stc_ee_operate_status.pData, stc_ee_operate_status.remainLen);
    }

    return stc_ee_operate_status.i32EEStatus;
}

/**
  * @brief  Read specified length data from FLASH
  * @param  [in] virtAddress        virtual eeprom address
  * @param  [out] data              pointer of data to be store
  * @param  [in] length             length of data
  * @retval int32_t:
  *         - EE_OK: Read successful.
  *         - EE_ERR: Data not be found.
  *         - EE_ERR_INVD_PARAM: Parameters error.
  *         - EE_ERR_SECT_INVALID: No valid sector was found.
  */
int32_t EE_ReadNBytes(ee_addr_size_t virtAddress, ee_data_size_t *data, ee_addr_size_t length)
{
    ee_addr_size_t index;
    int32_t ret = EE_OK;

    if (virtAddress + length > EE_CAPACITY) {
        return EE_ERR_INVD_PARAM;
    }

    if (0U == length) {
        return EE_ERR_INVD_PARAM;
    }

    for (index = 0U; index < length; index++) {
        ret = EE_ReadDataformFlash(virtAddress + index, data++);
        if (EE_OK != ret) {
            return ret;
        }
    }

    return ret;
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
